{
  "historias_de_usuario": [
    {
      "id_historia": "ANDERSEN-001",
      "titulo": "Desarrollo de ETL",
      "usuario": "Eddy",
      "esfuerzo": "2",
      "tipo": "Operativa",
      "requerimiento": "",
      "objetivo": "",
      "criterios_de_aceptacion": [
        "El sistema debe ejecutar el proceso de Extracción, Transformación y Carga (ETL) correctamente para integrar los datos requeridos."
      ]
    },
    {
      "id_historia": "ANDERSEN-002",
      "titulo": "Desarrollo de módulo de monitoreo",
      "usuario": "Eddy",
      "esfuerzo": "5",
      "tipo": "Operativa",
      "requerimiento": "",
      "objetivo": "",
      "criterios_de_aceptacion": [
        "El sistema debe contar con un módulo funcional que permita visualizar y registrar el estado de los servicios monitoreados."
      ]
    },
    {
      "id_historia": "ANDERSEN-003",
      "titulo": "Pruebas y Consumo de API Monday (Graphql)",
      "usuario": "Eddy",
      "esfuerzo": "3",
      "tipo": "Operativa",
      "requerimiento": "",
      "objetivo": "",
      "criterios_de_aceptacion": [
        "El sistema debe conectarse exitosamente a la API de Monday utilizando GraphQL y superar las pruebas de consumo de datos."
      ]
    },
    {
      "id_historia": "ANDERSEN-004",
      "titulo": "Actualización de documentación",
      "usuario": "Eddy",
      "esfuerzo": "0,5",
      "tipo": "Operativa",
      "requerimiento": "",
      "objetivo": "",
      "criterios_de_aceptacion": [
        "La documentación del proyecto debe estar revisada y actualizada reflejando los cambios recientes en el desarrollo."
      ]
    }
  ],
  "preguntas_para_aclarar": [
    "Sobre 'Desarrollo de ETL': ¿Cuáles son específicamente las fuentes de datos (origen) y el destino final? ¿Existen reglas de negocio complejas para la transformación de los datos?",
    "Sobre 'Desarrollo de módulo de monitoreo': ¿Qué métricas o KPIs específicos se deben monitorear? ¿Se requiere un sistema de alertas (notificaciones) ante fallos?",
    "Sobre 'API Monday (Graphql)': ¿Qué entidades específicas de Monday (Tableros, Items, Actualizaciones) se deben consultar o modificar? ¿Qué tipo de autenticación se utilizará?",
    "Sobre 'Actualización de documentación': ¿Se refiere a documentación técnica (código/arquitectura), manuales de usuario o documentación de API (Swagger)? ¿Existe un formato o plantilla predefinida?"
  ]
}
